Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/debuggercore-omegat.tmx
Source language: en_us
Languages: pt_br

source: Debugger Core API
pt_br: API do núcleo do depurador

source: Debugging
pt_br: Depurando

source: NetBeans Debugger APIs.
pt_br: APIs de depuração do NetBeans.

source: Debugger Window
pt_br: Janela do depurador

source: Source Editor
pt_br: Editor de código-fonte

source: Debugger Settings
pt_br: Configurações do depurador

source: Default Debugging
pt_br: Depuração padrão

source: Debugger Execution
pt_br: Execução do depurador

source: &Start Debugger Session
pt_br: Iniciar &sessão do depurador

source: &Stack
pt_br: Pil&ha

source: &Debug Active Project
pt_br: &Depurar projeto ativo

source: D&ebug Profiles
pt_br: D&epurar perfis

source: De&bugging
pt_br: De&purando

source: Debugger Annotation
pt_br: Anotações de depuração

source: Breakpoint
pt_br: Ponto de interrupção

source: Disabled Breakpoint
pt_br: Ponto de interrupção desabilitado

source: Conditional Breakpoint
pt_br: Ponto de interrupção condicional

source: Disabled Conditional Breakpoint
pt_br: Ponto de interrupção condicional desabilitado

source: Current Program Counter
pt_br: Contador do programa atual

source: Multiple Breakpoints
pt_br: Múltiplos pontos de interrupção

source: Multiple Disabled Breakpoints
pt_br: Múltiplos pontos de interrupção desabilitados

source: Multiple Enabled and Disabled Breakpoints
pt_br: Múltiplos pontos de interrupção habilitados e desabilitados

source: Program Counter and a Breakpoint
pt_br: Contador de programa e um ponto de interrupção

source: Program Counter and a Conditional Breakpoint
pt_br: Contador de programa e um ponto de interrupção condicional

source: Program Counter and a Disabled Breakpoint
pt_br: Contador de programa e um ponto de interrupção desabilitado

source: Program Counter and a Disabled Conditional Breakpoint
pt_br: Contador de programa e um ponto de interrupção condicional desativado

source: Program Counter and Multiple Breakpoints
pt_br: Contador de programa e múltiplos pontos de interrupção

source: Program Counter and Multiple Disabled Breakpoints
pt_br: Contador de programa e múltiplos pontos de interrupção desabilitados

source: Call Site
pt_br: Local de chamada

source: Current Program Counter In Expression
pt_br: Contador do programa atual na expressão

source: Current Expression
pt_br: Expressão atual

source: Debugger Core - UI
pt_br: Núcleo do depurador - UI

source: Basic shared debugger UI.
pt_br: Interface gráfica básica compartilhada do depurador.

source: Debugger finished
pt_br: O depurador terminou

source: &Watch Expression:
pt_br: Expressão do obser&vador:

source: New Watch
pt_br: Novo observador

source: &Debugger:
pt_br: &Depurador:

source: Type of the debugger to connect
pt_br: Tipo de depurador para conectar

source: Connects debugger to some currently running process
pt_br: Conectar o depurador a alguns processos em execução atualmente

source: Sessio&ns
pt_br: Sessõ&es

source: Call Stac&k
pt_br: Pilha de c&hamadas

source: &Local Variables
pt_br: Variáveis &locais

source: &Watches
pt_br: Obser&vadores

source: &Breakpoints
pt_br: &Pontos de parada

source: &Debug Main Project
pt_br: &Depurar o projeto principal

source: Run {0,choice,0#Project|1#"{1}" Project|1<{0} Projects} in Debugger
pt_br: Executar {0,choice,0#projeto|1#"{1}" projeto|1<{0} Projetos} no depurador

source: Debug
pt_br: Depurar

source: &Debug {0,choice,0#File|1#"{1}"|1<Files}
pt_br: &Depurar {0,choice,0#arquivo|1#"{1}"|1<arquivos}

source: Debug Test &for {0,choice,0#File|1#"{1}"|1<Files}
pt_br: Depurar teste &para {0,choice,0#o arquivo|1#"{1}"|1<os arquvios}

source: New &Watch...
pt_br: Novo obser&vador...

source: Cannot debug class {0} (not executable).
pt_br: Não pode depurar a classe {0} (não executável).

source: Debugger exception: {0}
pt_br: Exceção do depurador: {0}

source: &Finish Debugger Session
pt_br: &Terminar sessão do depurador

source: &Run in Debugger
pt_br: Executa&r no depurador

source: Step &Into
pt_br: Passar den&tro

source: Run Into &Method
pt_br: Executar no &método

source: Step O&ver
pt_br: Passar so&bre

source: Step &Out
pt_br: Passar f&ora

source: Step Over &Expression
pt_br: Passar sobre a &expressão

source: &Continue
pt_br: &Continuar

source: &Pause
pt_br: &Pausa

source: R&un to Cursor
pt_br: Exec&utar para o cursor

source: Suspend
pt_br: Suspender

source: &Toggle Line Breakpoint
pt_br: Al&ternar linha do ponto de interrupção

source: Resume
pt_br: Retornar

source: Finish
pt_br: Terminar

source: Make Current
pt_br: Tornar atual

source: Cancel
pt_br: Cancelar

source: New &Breakpoint...
pt_br: Novo ponto de interrupção...

source: Class Name:
pt_br: Nome da classe:

source: Method Name:
pt_br: Nome do método:

source: Cannot attach.
pt_br: Não pode anexar.

source: Check the parameters and try again.
pt_br: Verifique os parâmetros e tente novamente.

source: Illegal {0,choice,1#value|2#values} of {0,choice,1#argument|2#arguments}: {1}.
pt_br: {0,choice,1#valor|2#valores} ilegal de {0,choice,1#argumento|2#argumentos}: {1}.

source: New Breakpoint
pt_br: Novo ponto de interrupção

source: Create Fixed Watch
pt_br: Criar observador fixo

source: Go to Source
pt_br: Ir para o código-fonte

source: Make &Caller Current
pt_br: Tornar &chamador atual

source: &Make Callee Current
pt_br: Tornar cha&mador atual

source: &Debugger Window
pt_br: Janela do &depurador

source: &Attach Debugger...
pt_br: &Anexar depurador...

source: Debugger exception
pt_br: Exceção do depurador

source: Attach
pt_br: Anexar

source: &Breakpoint Type:
pt_br: Tipo do &ponto de interrupção:

source: Settings
pt_br: Configurações

source: Actions
pt_br: Ações

source: Debugger Types
pt_br: Tipos de depurador

source: Breakpoint Types
pt_br: Tipos de ponto de interrupção

source: Possible Actions When Reaching This Breakpoint
pt_br: Possíveis ações quando alcançar este ponto de interrupção

source: New breakpoint of specified type
pt_br: Novo ponto de interrupção de um tipo específico

source: Enable All
pt_br: Habilitar todos

source: Disable All
pt_br: Desabilitar todos

source: Delete All
pt_br: Excluir todos

source: New breakpoint on variable modification
pt_br: Novo ponto de interrupção em modificação de variável

source: New breakpoint on variable access
pt_br: Novo ponto de interrupção em acesso de variável

source: Cannot attach to the specified host - host unknown.
pt_br: Não pode anexar ao computador especificado - computador desconhecido.

source: Display As
pt_br: Exibir como

source: Binary
pt_br: Binário

source: Apply Cod&e Changes
pt_br: Aplicar alteraçõ&es do código

source: &Pop Topmost Call
pt_br: Retirar a última chamada da &pilha

source: Sessions
pt_br: Sessões

source: Session Name
pt_br: Nome da sessão

source: Name of this session.
pt_br: Nome desta sessão.

source: Hostname
pt_br: Nome do computador

source: A name of computer this session is running on.
pt_br: Um nome de computador da sessão em execução.

source: Starting
pt_br: Iniciando

source: Running
pt_br: Em execução

source: On Breakpoint
pt_br: No ponto de interrupção

source: Paused
pt_br: Pausado

source: State
pt_br: Estado

source: Debugger
pt_br: Depurador

source: Sessions View
pt_br: Visualizar sessão

source: Breakpoints
pt_br: Pontos de interrupção

source: Breakpoints View
pt_br: Visualizar pontos de parada

source: Threads View
pt_br: Visualização de threads

source: Call Stack
pt_br: Pilha de chamadas

source: Call Stack View
pt_br: Visualização da pilha de chamadas

source: Watches
pt_br: Observadores

source: Watches View
pt_br: Visualização de observadores

source: Local Variables
pt_br: Variáveis locais

source: Variables View
pt_br: Visualização de variáveis

source: Class Name
pt_br: Nome da classe

source: Name of the class containing this breakpoint.
pt_br: Nome da classe contendo este ponto de interrupção

source: Method Name
pt_br: Nome do método

source: Name of the method this breakpoint is set on, if applicable.
pt_br: O nome do método deste ponto de interrupção está definido sobre, se aplicável.

source: Line Number
pt_br: Número da linha

source: The line number this breakpoint is set on, if applicable.
pt_br: O número da linha deste ponto de interrupção está definido sobre, se aplicável.

source: Enabled
pt_br: Habilitado

source: If True, this breakpoint is currently enabled.
pt_br: Se verdadeiro, este ponto de interrupção está habilitado atualmente

source: Valid
pt_br: Válido

source: If True, this breakpoint points to a valid position.
pt_br: Se verdadeiro, este ponto de interrupção aponta para uma posição válida.

source: Condition
pt_br: Condição

source: Determines whether the suspend and print actions will be performed.
pt_br: Determina quando suspender e imprimir ações serão executados.

source: breakpoint
pt_br: ponto de interrupção

source: breakpoint [not valid]
pt_br: ponto de interrupção [não válido]

source: Name
pt_br: Nome

source: Name of the breakpoint group
pt_br: Nome de grupo do ponto de parada

source: Class name
pt_br: Nome da classe

source: Method name
pt_br: Nome do método

source: Line number
pt_br: Número da linha

source: not running
pt_br: Não executando

source: starting
pt_br: iniciando

source: running
pt_br: em execução

source: stopped at a breakpoint
pt_br: parado no ponto de interrupção

source: Represents all aspects of the debugger's current state and configuration.
pt_br: Representa todos os aspectos do estado atual e da configuração do depurador.

source: Debugger State
pt_br: Estado do depurador

source: Current status of the debugger.
pt_br: Estado atual do depurador.

source: Show Messages
pt_br: Mostrar mensagens

source: Whether the debugger shows information messages.
pt_br: Se o depurador mostra mensagens de informação.

source: Show in Editor
pt_br: Exibir no editor

source: Whether the class the debugger is stopped at is shown in the Editor.
pt_br: Se a classe a depurar está parada é mostrado no editor.

source: Remote Debugging
pt_br: Depuração remota

source: Remote debugging
pt_br: Depuração remota

source: Total Memory
pt_br: Memória total

source: Total memory
pt_br: Memória total

source: Free Memory
pt_br: Memória livre

source: Free memory
pt_br: Memória livre

source: Source Path
pt_br: Caminho do código-fonte

source: Source path
pt_br: Caminho do código-fonte

source: Catch List
pt_br: Lista de catch

source: Catch list
pt_br: Lista de catch

source: Locals
pt_br: Locais

source: Name of this thread.
pt_br: Nome desta thread.

source: Running state of this thread.
pt_br: Estado de execução desta thread.

source: Class
pt_br: Classe

source: Method
pt_br: Método

source: Number of line
pt_br: Número da linha

source: Stack Depth
pt_br: Profundidade da pilha

source: Depth of stack
pt_br: Profundidade da pilha

source: Frame Index
pt_br: Índice do quadro

source: Frame index
pt_br: Índice do quadro

source: Suspended
pt_br: Suspenso

source: Thread Group
pt_br: Grupo de threads

source: Name of this thread group
pt_br: Nome deste grupo de threads

source: Name of Variable
pt_br: Nome da variável

source: Name of variable
pt_br: Nome da variável

source: [No session]
pt_br: [Sem sessão]

source: [Not in scope]
pt_br: [Fora de escopo]

source: [Not initialized]
pt_br: [Não inicializado]

source: Field Type
pt_br: Tipo de campo

source: Type of variable
pt_br: Tipo da variável

source: Type
pt_br: Tipo

source: Type of value
pt_br: Tipo de valor

source: Modifiers
pt_br: Modificadores

source: Value
pt_br: Valor

source: Value of variable
pt_br: Valor da variável

source: First Index
pt_br: Primeiro índice

source: First index of the field to be displayed
pt_br: Primeiro índice do campo a ser exibido

source: Maximum Length
pt_br: Comprimento máximo

source: Maximum number of fields to be displayed
pt_br: Número máximo de campos a serem exibidos

source: Is in Scope
pt_br: Está no escopo

source: Is in scope
pt_br: Está no escopo

source: Create Variable Access Breakpoint
pt_br: Criar ponto de interrupção de acesso a variável

source: Create Variable Modification Breakpoint
pt_br: Criar ponto de interrupção de criação de variável

source: Variables
pt_br: Variáveis

source: Paste
pt_br: Colar

source: All in One
pt_br: Tudo em um

source: A name used to identify the session.
pt_br: Um nome usado para identificar a sessão.

source: A description of the current state of the session.
pt_br: Uma descrição do estado atual da sessão.

source: Language
pt_br: Linguagem

source: A name used to identify the thread.
pt_br: Um nome usado para identificar a thread.

source: A description of the current state of the thread.
pt_br: Uma descrição do estado atual da thread.

source: Suspended state
pt_br: Estado suspenso

source: The qualified name of the class that execution is within on the thread.
pt_br: O nome qualificado da classe em que a execução está dentro da thread.

source: The name of watch.
pt_br: Um nome de observador.

source: The type as it is known to the runtime system.
pt_br: O tipo tal como é conhecido pelo sistema em tempo de execução.

source: The current value of the watch.
pt_br: Valor atual do observador.

source: Is In Scope
pt_br: Está no escopo

source: Summary
pt_br: Resumo

source: An identifier of the function or method corresponding to the frame.
pt_br: Um identificador de função ou método correspondente para o quadro.

source: Location
pt_br: Localização

source: The file and line number of the source code corresponding to the current instruction.
pt_br: Um arquivo e o número da linha do código-fonte correspondente a instrução atual.

source: The name of the variable
pt_br: um nome de variável

source: The current value of the variable.
pt_br: O valor atual da variável.

source: Properties - {0}
pt_br: Propriedades - {0}

source: Group of Breakpoints
pt_br: Grupo de pontos de parada

source: Name of breakpoint
pt_br: Nome do ponto de parada

source: E
pt_br: H

source: Disables / enables breakpoint
pt_br: Desabilita / habilita o ponto de interrupção

source: Name of call stack frame
pt_br: Nome do frame da pilha de chamadas

source: Location of callstack frame
pt_br: Localização do frame da pilha de chamadas

source: Displays value of toString() call
pt_br: Exibe o valor da chamada toString()

source: Name of session
pt_br: Nome da sessão

source: Host Name
pt_br: Nome do computador

source: H
pt_br: c

source: Computer name this session is running on
pt_br: Nome do computador da sessão em execução

source: Describes state of session
pt_br: Descreve o estado da sessão

source: Current language of session
pt_br: Linguagem atual da sessão

source: Name of thread
pt_br: Nome da thread

source: Describes state of thread
pt_br: Descreve o estado da thread

source: Is thread suspended by debugger
pt_br: A thread está suspensa pelo depurador

source: = [No current context]
pt_br: = [Sem contexto atual]

source: Name of watch
pt_br: Nome do observador

source: Type of result
pt_br: Tipo de resultado

source: Value of watch expression
pt_br: Valor da expressão do observador

source: Finish All
pt_br: Terminar tudo

source: New Breakpoint ...
pt_br: Novo ponto de interrupção ...

source: Enable
pt_br: Habilitar

source: Disable
pt_br: Desabilitar

source: Delete
pt_br: Excluir

source: Set Group Name
pt_br: Definir nome do grupo

source: Name of Group:
pt_br: Nome do grupo:

source: Set the Name of Breakpoints Group
pt_br: Definir o nome do grupo de pontos de interrupção

source: New Watch ...
pt_br: Novo observador...

source: Customize
pt_br: Personalizar

source: TreeTableView Model
pt_br: Modelo de TreeTableView

source: Infrastructure
pt_br: Infra-estrutura

source: Evaluating...
pt_br: Calculando...

source: Please wait...
pt_br: Aguarde...
